[Survived] BooleanLiteral
frontend/src/components/Login.js:21:38
 const [message, setMessage] = useState("");
 const [successful, setSuccessful] = useState(false);
 
-const [errMsg, setErrMsg] = useState(false);
+const [errMsg, setErrMsg] = useState(true);
 
 const onChangeEmail = (e) => {

[Survived] StringLiteral
frontend/src/components/Login.js:39:20
 .has().lowercase()                              // Must have lowercase letters
 .has().digits(2)                                // Must have at least 2 digits
 .has().not().spaces()                           // Should not have spaces
-.is().not().oneOf(['Passw0rd', 'Password123']); // Blacklist these values
+.is().not().oneOf(["", 'Password123']); // Blacklist these values
 
 const onChangePassword = (e) => {

[NoCoverage] BlockStatement
frontend/src/components/Login.js:54:23
     setSuccessful(false);
 
     AuthService.login(email, password).then(
-        (response) => {
-            setMessage("Login Successful!");
-            console.log(response.status);
-            setErrMsg(false)
-            setSuccessful(true);
-            
-          }).catch((error) => {
+        (response) => {}).catch((error) => {
             setSuccessful(false);
             const resMessage =

[NoCoverage] StringLiteral
frontend/src/components/Login.js:55:24
 
     AuthService.login(email, password).then(
         (response) => {
-            setMessage("Login Successful!");
+            setMessage("");
             console.log(response.status);
             setErrMsg(false)

[NoCoverage] BooleanLiteral
frontend/src/components/Login.js:57:23
         (response) => {
             setMessage("Login Successful!");
             console.log(response.status);
-            setErrMsg(false)
+            setErrMsg(true)
             setSuccessful(true);
             

[NoCoverage] BooleanLiteral
frontend/src/components/Login.js:58:27
             setMessage("Login Successful!");
             console.log(response.status);
             setErrMsg(false)
-            setSuccessful(true);
+            setSuccessful(false);
             
           }).catch((error) => {

[NoCoverage] BlockStatement
frontend/src/components/Login.js:60:31
             setErrMsg(false)
             setSuccessful(true);
             
-          }).catch((error) => {
-            setSuccessful(false);
-            const resMessage =
-              (error.response &&
-                error.response.data &&
-                error.response.data.message) ||
-              error.message ||
-              error.toString();
-              //setMessage(resMessage);
-              console.log(successful);
-            error.response.status == 401? (setMessage("Unauthorized Access!"))
-                : (setMessage("Fatal Error!")) ;
-            //setMessage(resMessage);
-            
-            setErrMsg(true);
-          }
+          }).catch((error) => {}
         );
     };

[NoCoverage] BooleanLiteral
frontend/src/components/Login.js:61:27
             setSuccessful(true);
             
           }).catch((error) => {
-            setSuccessful(false);
+            setSuccessful(true);
             const resMessage =
               (error.response &&

[NoCoverage] ConditionalExpression
frontend/src/components/Login.js:70:13
               error.toString();
               //setMessage(resMessage);
               console.log(successful);
-            error.response.status == 401? (setMessage("Unauthorized Access!"))
+            false? (setMessage("Unauthorized Access!"))
                 : (setMessage("Fatal Error!")) ;
             //setMessage(resMessage);

[NoCoverage] ConditionalExpression
frontend/src/components/Login.js:70:13
               error.toString();
               //setMessage(resMessage);
               console.log(successful);
-            error.response.status == 401? (setMessage("Unauthorized Access!"))
+            true? (setMessage("Unauthorized Access!"))
                 : (setMessage("Fatal Error!")) ;
             //setMessage(resMessage);

[NoCoverage] BooleanLiteral
frontend/src/components/Login.js:74:23
                 : (setMessage("Fatal Error!")) ;
             //setMessage(resMessage);
             
-            setErrMsg(true);
+            setErrMsg(false);
           }
         );

[Survived] ObjectLiteral
frontend/src/components/Login.js:81:33
 
 
 return (
-<Grid textAlign='center' style={{ height: '100vh' }} verticalAlign='middle'>
+<Grid textAlign='center' style={{}} verticalAlign='middle'>
     <Grid.Column style={{ maxWidth: 450 }}>
     <Header as='h2' color='black' textAlign='center'>

[Survived] ObjectLiteral
frontend/src/components/Login.js:82:25
 
 return (
 <Grid textAlign='center' style={{ height: '100vh' }} verticalAlign='middle'>
-    <Grid.Column style={{ maxWidth: 450 }}>
+    <Grid.Column style={{}}>
     <Header as='h2' color='black' textAlign='center'>
         <Image src='\Time-Flocker-logo.png'

[NoCoverage] ObjectLiteral
frontend/src/components/Login.js:94:40
         <Form.Input fluid icon='user' iconPosition='left' placeholder='E-mail address'
             value={email}
             onChange={onChangeEmail}
-            error={validEmail ? false: {
-                content: 'Please enter a valid email address.',
-                pointing: 'below'
-            }}/>
+            error={validEmail ? false: {}}/>
         <Form.Input
             fluid

[NoCoverage] StringLiteral
frontend/src/components/Login.js:96:27
             onChange={onChangeEmail}
             error={validEmail ? false: {
                 content: 'Please enter a valid email address.',
-                pointing: 'below'
+                pointing: ""
             }}/>
         <Form.Input
