[Killed] OptionalChaining
frontend/src/components/Dashboard.js:49:17
   const currentUser = AuthService.getCurrentUser();
   
   const [data, setdata] = useState({
-    "username": currentUser?.user_data[0].username,
+    "username": currentUser.user_data[0].username,
     "employee_id": currentUser?.user_data[0].employee_id,
   //   "password": ""
killedBy: mock components tests renders without crashing
statusReason: TypeError: Cannot read property 'user_data' of null

[Killed] OptionalChaining
frontend/src/components/Dashboard.js:50:20
   
   const [data, setdata] = useState({
     "username": currentUser?.user_data[0].username,
-    "employee_id": currentUser?.user_data[0].employee_id,
+    "employee_id": currentUser.user_data[0].employee_id,
   //   "password": ""
   });
killedBy: mock components tests renders without crashing
statusReason: TypeError: Cannot read property 'user_data' of null

[Survived] BooleanLiteral
frontend/src/components/Dashboard.js:54:46
   //   "password": ""
   });
 
-  const [tableData, setTableData] = useState(false);
+  const [tableData, setTableData] = useState(true);
 
   const getTableData = () => {

[Survived] BlockStatement
frontend/src/components/Dashboard.js:56:30
 
   const [tableData, setTableData] = useState(false);
 
-  const getTableData = () => {
-    userServices.getTimehsheets().then(
-    (response) => {
-      if(response.data == 'Not Found'){
-        setTableData(false);
-      }
-      else{
-        setTableData(response.data);
-      }
-      
-    }).catch((error) => {
-      console.log(error);
-    })
-  }
+  const getTableData = () => {}
 
   useEffect(() => {

[NoCoverage] BlockStatement
frontend/src/components/Dashboard.js:58:19
 
   const getTableData = () => {
     userServices.getTimehsheets().then(
-    (response) => {
-      if(response.data == 'Not Found'){
-        setTableData(false);
-      }
-      else{
-        setTableData(response.data);
-      }
-      
-    }).catch((error) => {
+    (response) => {}).catch((error) => {
       console.log(error);
     })

[NoCoverage] EqualityOperator
frontend/src/components/Dashboard.js:59:10
   const getTableData = () => {
     userServices.getTimehsheets().then(
     (response) => {
-      if(response.data == 'Not Found'){
+      if(response.data != 'Not Found'){
         setTableData(false);
       }

[NoCoverage] ConditionalExpression
frontend/src/components/Dashboard.js:59:10
   const getTableData = () => {
     userServices.getTimehsheets().then(
     (response) => {
-      if(response.data == 'Not Found'){
+      if(false){
         setTableData(false);
       }

[NoCoverage] BooleanLiteral
frontend/src/components/Dashboard.js:60:22
     userServices.getTimehsheets().then(
     (response) => {
       if(response.data == 'Not Found'){
-        setTableData(false);
+        setTableData(true);
       }
       else{

[NoCoverage] BlockStatement
frontend/src/components/Dashboard.js:62:11
       if(response.data == 'Not Found'){
         setTableData(false);
       }
-      else{
-        setTableData(response.data);
-      }
+      else{}
       
     }).catch((error) => {

[NoCoverage] BlockStatement
frontend/src/components/Dashboard.js:66:25
         setTableData(response.data);
       }
       
-    }).catch((error) => {
-      console.log(error);
-    })
+    }).catch((error) => {})
   }
 

[Survived] BlockStatement
frontend/src/components/Dashboard.js:71:19
     })
   }
 
-  useEffect(() => {
-    getTableData();
-  }, []);
+  useEffect(() => {}, []);
 
     return (

[Survived] ObjectLiteral
frontend/src/components/Dashboard.js:80:70
         <Grid padded className="tablet computer only">
           <Menu borderless inverted fluid fixed="top" color="red">
             <Menu.Item content header as={Link} to='/'>
-              <Image size='mini' src='/Time-Flocker-logo.png' style={{ marginRight: '1.5em' }}/>
+              <Image size='mini' src='/Time-Flocker-logo.png' style={{}}/>
               Timeflocker
             </Menu.Item>

[Survived] StringLiteral
frontend/src/components/Dashboard.js:80:85
         <Grid padded className="tablet computer only">
           <Menu borderless inverted fluid fixed="top" color="red">
             <Menu.Item content header as={Link} to='/'>
-              <Image size='mini' src='/Time-Flocker-logo.png' style={{ marginRight: '1.5em' }}/>
+              <Image size='mini' src='/Time-Flocker-logo.png' style={{ marginRight: "" }}/>
               Timeflocker
             </Menu.Item>

[Survived] BooleanLiteral
frontend/src/components/Dashboard.js:94:16
               : null
             } 
               <Menu.Item as="a">Help</Menu.Item>
-              {!authService.isLoggedIn() //for some reason, it works counter-intuitive
+              {authService.isLoggedIn() //for some reason, it works counter-intuitive
               ? <Menu.Item as={Link} to='/Profile'>Hello, {currentUser?.user_data[0].first_name} </Menu.Item>
               : <Menu.Item as="a">Login/Sign Up</Menu.Item>}

[NoCoverage] OptionalChaining
frontend/src/components/Dashboard.js:95:60
             } 
               <Menu.Item as="a">Help</Menu.Item>
               {!authService.isLoggedIn() //for some reason, it works counter-intuitive
-              ? <Menu.Item as={Link} to='/Profile'>Hello, {currentUser?.user_data[0].first_name} </Menu.Item>
+              ? <Menu.Item as={Link} to='/Profile'>Hello, {currentUser.user_data[0].first_name} </Menu.Item>
               : <Menu.Item as="a">Login/Sign Up</Menu.Item>}
               

[Killed] ObjectLiteral
frontend/src/components/Dashboard.js:176:27
                 {/* Pie Chart #1 */}
                 <Grid.Column mobile={8} tablet={4} computer={4}>
                   <Pie
-                    data={{ labels: ['Red', 'Blue', 'Yellow', 'Green', 'Purple', 'Orange'],
-                    datasets: [ {
-                        label: '# of votes',
-                        data: [12, 23, 8, 19, 60, 1],
-                        backgroundColor: [
-                            'rgba(255, 99, 132, 0.2)',
-                            'rgba(54, 162, 235, 0.2)',
-                            'rgba(255, 206, 86, 0.2)',
-                            'rgba(75, 192, 192, 0.2)',
-                            'rgba(153, 102, 255, 0.2)',
-                            'rgba(255, 159, 64, 0.2)'
-                        ],
-                        borderColor: [
-                            'rgba(255, 99, 132, 1)',
-                            'rgba(54, 162, 235, 1)',
-                            'rgba(255, 206, 86, 1)',
-                            'rgba(75, 192, 192, 1)',
-                            'rgba(153, 102, 255, 1)',
-                            'rgba(255, 159, 64, 1)'
-                        ],
-                        borderWidth: 1
-                    }]
-                            }}
+                    data={{}}
                     width={2000}
                     height={2000}
killedBy: mock components tests renders without crashing
statusReason: TypeError: Cannot read property 'map' of undefined

[Survived] StringLiteral
frontend/src/components/Dashboard.js:176:38
                 {/* Pie Chart #1 */}
                 <Grid.Column mobile={8} tablet={4} computer={4}>
                   <Pie
-                    data={{ labels: ['Red', 'Blue', 'Yellow', 'Green', 'Purple', 'Orange'],
+                    data={{ labels: ["", 'Blue', 'Yellow', 'Green', 'Purple', 'Orange'],
                     datasets: [ {
                         label: '# of votes',

[Survived] ArrayDeclaration
frontend/src/components/Dashboard.js:177:31
                 <Grid.Column mobile={8} tablet={4} computer={4}>
                   <Pie
                     data={{ labels: ['Red', 'Blue', 'Yellow', 'Green', 'Purple', 'Orange'],
-                    datasets: [ {
-                        label: '# of votes',
-                        data: [12, 23, 8, 19, 60, 1],
-                        backgroundColor: [
-                            'rgba(255, 99, 132, 0.2)',
-                            'rgba(54, 162, 235, 0.2)',
-                            'rgba(255, 206, 86, 0.2)',
-                            'rgba(75, 192, 192, 0.2)',
-                            'rgba(153, 102, 255, 0.2)',
-                            'rgba(255, 159, 64, 0.2)'
-                        ],
-                        borderColor: [
-                            'rgba(255, 99, 132, 1)',
-                            'rgba(54, 162, 235, 1)',
-                            'rgba(255, 206, 86, 1)',
-                            'rgba(75, 192, 192, 1)',
-                            'rgba(153, 102, 255, 1)',
-                            'rgba(255, 159, 64, 1)'
-                        ],
-                        borderWidth: 1
-                    }]
+                    datasets: []
                             }}
                     width={2000}

[Survived] StringLiteral
frontend/src/components/Dashboard.js:178:32
                   <Pie
                     data={{ labels: ['Red', 'Blue', 'Yellow', 'Green', 'Purple', 'Orange'],
                     datasets: [ {
-                        label: '# of votes',
+                        label: "",
                         data: [12, 23, 8, 19, 60, 1],
                         backgroundColor: [

[Survived] StringLiteral
frontend/src/components/Dashboard.js:182:29
                         data: [12, 23, 8, 19, 60, 1],
                         backgroundColor: [
                             'rgba(255, 99, 132, 0.2)',
-                            'rgba(54, 162, 235, 0.2)',
+                            "",
                             'rgba(255, 206, 86, 0.2)',
                             'rgba(75, 192, 192, 0.2)',

[Survived] StringLiteral
frontend/src/components/Dashboard.js:185:29
                             'rgba(54, 162, 235, 0.2)',
                             'rgba(255, 206, 86, 0.2)',
                             'rgba(75, 192, 192, 0.2)',
-                            'rgba(153, 102, 255, 0.2)',
+                            "",
                             'rgba(255, 159, 64, 0.2)'
                         ],

[Survived] StringLiteral
frontend/src/components/Dashboard.js:186:29
                             'rgba(255, 206, 86, 0.2)',
                             'rgba(75, 192, 192, 0.2)',
                             'rgba(153, 102, 255, 0.2)',
-                            'rgba(255, 159, 64, 0.2)'
+                            ""
                         ],
                         borderColor: [

[Survived] StringLiteral
frontend/src/components/Dashboard.js:189:29
                             'rgba(255, 159, 64, 0.2)'
                         ],
                         borderColor: [
-                            'rgba(255, 99, 132, 1)',
+                            "",
                             'rgba(54, 162, 235, 1)',
                             'rgba(255, 206, 86, 1)',

[Survived] StringLiteral
frontend/src/components/Dashboard.js:190:29
                         ],
                         borderColor: [
                             'rgba(255, 99, 132, 1)',
-                            'rgba(54, 162, 235, 1)',
+                            "",
                             'rgba(255, 206, 86, 1)',
                             'rgba(75, 192, 192, 1)',

[Survived] StringLiteral
frontend/src/components/Dashboard.js:193:29
                             'rgba(54, 162, 235, 1)',
                             'rgba(255, 206, 86, 1)',
                             'rgba(75, 192, 192, 1)',
-                            'rgba(153, 102, 255, 1)',
+                            "",
                             'rgba(255, 159, 64, 1)'
                         ],

[Survived] BooleanLiteral
frontend/src/components/Dashboard.js:201:48
                             }}
                     width={2000}
                     height={2000}
-                    options={{mainAspectRatio: false}}/>
+                    options={{mainAspectRatio: true}}/>
                 </Grid.Column>
                 {/* Pie chart #2 */}

[Survived] ObjectLiteral
frontend/src/components/Dashboard.js:201:30
                             }}
                     width={2000}
                     height={2000}
-                    options={{mainAspectRatio: false}}/>
+                    options={{}}/>
                 </Grid.Column>
                 {/* Pie chart #2 */}

[Survived] StringLiteral
frontend/src/components/Dashboard.js:206:45
                 {/* Pie chart #2 */}
                 <Grid.Column mobile={8} tablet={4} computer={4}>
                   <Pie
-                    data={{ labels: ['Red', 'Blue', 'Yellow', 'Green', 'Purple', 'Orange'],
+                    data={{ labels: ['Red', "", 'Yellow', 'Green', 'Purple', 'Orange'],
                     datasets: [ {
                         label: '# of votes',

[Survived] StringLiteral
frontend/src/components/Dashboard.js:224:29
                             'rgba(255, 206, 86, 1)',
                             'rgba(75, 192, 192, 1)',
                             'rgba(153, 102, 255, 1)',
-                            'rgba(255, 159, 64, 1)'
+                            ""
                         ],
                         borderWidth: 1

[Survived] StringLiteral
frontend/src/components/Dashboard.js:243:37
               </Grid.Row>
               <Grid.Row>
                 <Table color="red" singleLine striped selectable unstackable
-                tableData={['some', 'random', 'array']}>
+                tableData={['some', "", 'array']}>
                   <Table.Header>
                     <Table.Row>

[NoCoverage] BlockStatement
frontend/src/components/Dashboard.js:255:69
                       {tableData 
                       ? <Table.Body>
                           {Object.values(tableData).map(
-                            ({ work_desc, start_time, end_time}) => {
-                              let start_formatted = new Date(start_time);
-                              let end_formatted = new Date(end_time);
-                              let hours_worked = (Math.abs(end_formatted
-                              - start_formatted) / 36e5).toFixed(2); 
-                              return (
-                                <Table.Row>
-                                  <Table.Cell>{work_desc}</Table.Cell>
-                                  <Table.Cell>{start_time}</Table.Cell>
-                                  <Table.Cell>{end_time}</Table.Cell>
-                                  <Table.Cell>{hours_worked} hour(s)</Table.Cell>
-                                </Table.Row>
-                              );
-                            }
+                            ({ work_desc, start_time, end_time}) => {}
                           )
                           }

[NoCoverage] ArithmeticOperator
frontend/src/components/Dashboard.js:258:60
                             ({ work_desc, start_time, end_time}) => {
                               let start_formatted = new Date(start_time);
                               let end_formatted = new Date(end_time);
-                              let hours_worked = (Math.abs(end_formatted
-                              - start_formatted) / 36e5).toFixed(2); 
+                              let hours_worked = (Math.abs(end_formatted + start_formatted) / 36e5).toFixed(2); 
                               return (
                                 <Table.Row>

[NoCoverage] ArithmeticOperator
frontend/src/components/Dashboard.js:258:51
                             ({ work_desc, start_time, end_time}) => {
                               let start_formatted = new Date(start_time);
                               let end_formatted = new Date(end_time);
-                              let hours_worked = (Math.abs(end_formatted
-                              - start_formatted) / 36e5).toFixed(2); 
+                              let hours_worked = (Math.abs(end_formatted - start_formatted) * 36e5).toFixed(2); 
                               return (
                                 <Table.Row>
