[Survived] BlockStatement
frontend/src/services/auth-header.js:1:38
-export default function authHeader() {
-    const user = JSON.parse(localStorage.getItem('user'));
-
-    if (user && user.accessToken) {
-      return { Authorization: 'Bearer ' + user.accessToken };
-    } else {
-      return {};
-    }
-  }
+export default function authHeader() {}
 

[Killed] LogicalOperator
frontend/src/services/auth-header.js:4:9
 export default function authHeader() {
     const user = JSON.parse(localStorage.getItem('user'));
 
-    if (user && user.accessToken) {
+    if (user || user.accessToken) {
       return { Authorization: 'Bearer ' + user.accessToken };
     } else {
killedBy: mock components tests renders without crashing
statusReason: TypeError: Cannot read property 'accessToken' of null

[Killed] ConditionalExpression
frontend/src/services/auth-header.js:4:9
 export default function authHeader() {
     const user = JSON.parse(localStorage.getItem('user'));
 
-    if (user && user.accessToken) {
+    if (true) {
       return { Authorization: 'Bearer ' + user.accessToken };
     } else {
killedBy: mock components tests renders without crashing
statusReason: TypeError: Cannot read property 'accessToken' of null

[NoCoverage] ObjectLiteral
frontend/src/services/auth-header.js:5:14
     const user = JSON.parse(localStorage.getItem('user'));
 
     if (user && user.accessToken) {
-      return { Authorization: 'Bearer ' + user.accessToken };
+      return {};
     } else {
       return {};

[NoCoverage] StringLiteral
frontend/src/services/auth-header.js:5:31
     const user = JSON.parse(localStorage.getItem('user'));
 
     if (user && user.accessToken) {
-      return { Authorization: 'Bearer ' + user.accessToken };
+      return { Authorization: "" + user.accessToken };
     } else {
       return {};

[Survived] BlockStatement
frontend/src/services/auth-header.js:6:12
 
     if (user && user.accessToken) {
       return { Authorization: 'Bearer ' + user.accessToken };
-    } else {
-      return {};
-    }
+    } else {}
   }
 
