[NoCoverage] BlockStatement
frontend/src/components/PayStubs.js:20:24
 
 const PayStubs = (props) => {
 
-const MenuList = () => {
-  return <Menu vertical borderless fluid text>
-  <Menu.Item as="a">
-    Overview
-  </Menu.Item>
-  <Menu.Item as="a">Timesheet</Menu.Item>
-  <Menu.Item active as="a">Pay Stubs</Menu.Item>
-  <Menu.Item as="a">Requests</Menu.Item>
-  <Menu.Item as="a">Work Trends</Menu.Item>
-</Menu>
-}
+const MenuList = () => {}
 
 return (
