[NoCoverage] BlockStatement
frontend/src/services/auth.service.js:5:94
 
 const API_URL = "https://time-flocker-2022.herokuapp.com/";
 
-const register = (username, user_email, user_password, role, wage, first_name, last_name) => {
-  return axios.post(API_URL + "employee", {
-    username,
-    user_email,
-    user_password,
-    role,
-    wage,
-    first_name, 
-    last_name
-  });
-};
+const register = (username, user_email, user_password, role, wage, first_name, last_name) => {};
 
 const login = async (user_email, user_password) => {

[NoCoverage] ObjectLiteral
frontend/src/services/auth.service.js:6:43
 const API_URL = "https://time-flocker-2022.herokuapp.com/";
 
 const register = (username, user_email, user_password, role, wage, first_name, last_name) => {
-  return axios.post(API_URL + "employee", {
-    username,
-    user_email,
-    user_password,
-    role,
-    wage,
-    first_name, 
-    last_name
-  });
+  return axios.post(API_URL + "employee", {});
 };
 

[NoCoverage] BlockStatement
frontend/src/services/auth.service.js:17:52
   });
 };
 
-const login = async (user_email, user_password) => {
-  const response = await axios
-    .post(API_URL + "login", {
-      user_email,
-      user_password,
-    });
-  if (response.data.access_token) {
-    localStorage.setItem("user", JSON.stringify(response.data));
-  }
-  return response;
-};
+const login = async (user_email, user_password) => {};
 
 const logout = () => {

[NoCoverage] ConditionalExpression
frontend/src/services/auth.service.js:23:7
       user_email,
       user_password,
     });
-  if (response.data.access_token) {
+  if (false) {
     localStorage.setItem("user", JSON.stringify(response.data));
   }

[NoCoverage] ConditionalExpression
frontend/src/services/auth.service.js:23:7
       user_email,
       user_password,
     });
-  if (response.data.access_token) {
+  if (true) {
     localStorage.setItem("user", JSON.stringify(response.data));
   }

[NoCoverage] BlockStatement
frontend/src/services/auth.service.js:29:22
   return response;
 };
 
-const logout = () => {
-  localStorage.removeItem("user");
-};
+const logout = () => {};
 
 const getCurrentUser = () => {

[Survived] BlockStatement
frontend/src/services/auth.service.js:33:30
   localStorage.removeItem("user");
 };
 
-const getCurrentUser = () => {
-  return JSON.parse(localStorage.getItem("user"));
-};
+const getCurrentUser = () => {};
 
 const isLoggedIn = () => {

[Survived] BlockStatement
frontend/src/services/auth.service.js:37:26
   return JSON.parse(localStorage.getItem("user"));
 };
 
-const isLoggedIn = () => {
-  return !localStorage.getItem("user"); //use a safer alternative
-}
+const isLoggedIn = () => {}
 const removeAcount = (id_user,obj) => {
   return axios.delete(API_URL + "User/users/"+id_user, {data:obj});

[Survived] BooleanLiteral
frontend/src/services/auth.service.js:38:10
 };
 
 const isLoggedIn = () => {
-  return !localStorage.getItem("user"); //use a safer alternative
+  return localStorage.getItem("user"); //use a safer alternative
 }
 const removeAcount = (id_user,obj) => {

[NoCoverage] BlockStatement
frontend/src/services/auth.service.js:40:39
 const isLoggedIn = () => {
   return !localStorage.getItem("user"); //use a safer alternative
 }
-const removeAcount = (id_user,obj) => {
-  return axios.delete(API_URL + "User/users/"+id_user, {data:obj});
-};
+const removeAcount = (id_user,obj) => {};
 
 const updateAcount = (id_user,obj) => {

[NoCoverage] BlockStatement
frontend/src/services/auth.service.js:44:39
   return axios.delete(API_URL + "User/users/"+id_user, {data:obj});
 };
 
-const updateAcount = (id_user,obj) => {
-  return axios.put(API_URL + "User/users/"+id_user, obj);
-};
+const updateAcount = (id_user,obj) => {};
 
 
