[Killed] OptionalChaining
frontend/src/components/Profile.js:27:22
   
     const [data, setdata] = useState({
       "username": currentUser?.user_data[0].username,
-      "employee_id": currentUser?.user_data[0].employee_id, //might not want to store employee_id as it is sensitive data
+      "employee_id": currentUser.user_data[0].employee_id, //might not want to store employee_id as it is sensitive data
     //   "password": ""
     });
killedBy: mock components tests renders without crashing
statusReason: TypeError: Cannot read property 'user_data' of null

[Killed] OptionalChaining
frontend/src/components/Profile.js:99:44
         >
         <Header textAlign='center' size='huge'>My Profile</Header> 
         <Icon style={{"margin-left":'30%'}} size='massive' name="user circle"/>
-        <Header textAlign='center'>Hello, {currentUser?.user_data &&
+        <Header textAlign='center'>Hello, {currentUser.user_data &&
                 currentUser?.user_data.map((uData) => uData.username)}!
         </Header>
killedBy: mock components tests renders without crashing
statusReason: TypeError: Cannot read property 'user_data' of null

[Survived] LogicalOperator
frontend/src/components/Profile.js:99:44
         >
         <Header textAlign='center' size='huge'>My Profile</Header> 
         <Icon style={{"margin-left":'30%'}} size='massive' name="user circle"/>
-        <Header textAlign='center'>Hello, {currentUser?.user_data &&
-                currentUser?.user_data.map((uData) => uData.username)}!
+        <Header textAlign='center'>Hello, {currentUser?.user_data || currentUser?.user_data.map(uData => uData.username)}!
         </Header>
 

[NoCoverage] ArrowFunction
frontend/src/components/Profile.js:100:44
         <Header textAlign='center' size='huge'>My Profile</Header> 
         <Icon style={{"margin-left":'30%'}} size='massive' name="user circle"/>
         <Header textAlign='center'>Hello, {currentUser?.user_data &&
-                currentUser?.user_data.map((uData) => uData.username)}!
+                currentUser?.user_data.map(() => undefined)}!
         </Header>
 

[NoCoverage] OptionalChaining
frontend/src/components/Profile.js:100:17
         <Header textAlign='center' size='huge'>My Profile</Header> 
         <Icon style={{"margin-left":'30%'}} size='massive' name="user circle"/>
         <Header textAlign='center'>Hello, {currentUser?.user_data &&
-                currentUser?.user_data.map((uData) => uData.username)}!
+                currentUser.user_data.map((uData) => uData.username)}!
         </Header>
 

[Killed] OptionalChaining
frontend/src/components/Profile.js:110:30
                         <Header>Email: 
                         <h3>
                             <Label basic>
-                            {currentUser?.user_data.map(uData => <div>{uData.user_email}</div> )}
+                            {currentUser.user_data.map(uData => <div>{uData.user_email}</div> )}
                             </Label>
                         </h3>
killedBy: mock components tests renders without crashing
statusReason: TypeError: Cannot read property 'user_data' of null

[NoCoverage] ArrowFunction
frontend/src/components/Profile.js:110:57
                         <Header>Email: 
                         <h3>
                             <Label basic>
-                            {currentUser?.user_data.map(uData => <div>{uData.user_email}</div> )}
+                            {currentUser?.user_data.map(() => undefined )}
                             </Label>
                         </h3>

[Killed] OptionalChaining
frontend/src/components/Profile.js:120:43
                     <p>  
                         <Header>Role:
                         <h3>
-                            <Label basic>{currentUser?.user_data &&
+                            <Label basic>{currentUser.user_data &&
                                 currentUser?.user_data.map((uData) => uData.role)}
                             </Label>  
killedBy: mock components tests renders without crashing
statusReason: TypeError: Cannot read property 'user_data' of null

[Survived] ConditionalExpression
frontend/src/components/Profile.js:120:43
                     <p>  
                         <Header>Role:
                         <h3>
-                            <Label basic>{currentUser?.user_data &&
-                                currentUser?.user_data.map((uData) => uData.role)}
+                            <Label basic>{false}
                             </Label>  
                         </h3>

[NoCoverage] ArrowFunction
frontend/src/components/Profile.js:121:60
                         <Header>Role:
                         <h3>
                             <Label basic>{currentUser?.user_data &&
-                                currentUser?.user_data.map((uData) => uData.role)}
+                                currentUser?.user_data.map(() => undefined)}
                             </Label>  
                         </h3>

[NoCoverage] OptionalChaining
frontend/src/components/Profile.js:121:33
                         <Header>Role:
                         <h3>
                             <Label basic>{currentUser?.user_data &&
-                                currentUser?.user_data.map((uData) => uData.role)}
+                                currentUser.user_data.map((uData) => uData.role)}
                             </Label>  
                         </h3>

[Killed] OptionalChaining
frontend/src/components/Profile.js:131:44
                     <p>  
                         <Header>Wage:
                         <h3>
-                            <Label basic>${currentUser?.user_data &&
+                            <Label basic>${currentUser.user_data &&
                                 currentUser?.user_data.map((uData) => uData.wage)}/h
                             </Label>  
killedBy: mock components tests renders without crashing
statusReason: TypeError: Cannot read property 'user_data' of null

[Survived] ConditionalExpression
frontend/src/components/Profile.js:131:44
                     <p>  
                         <Header>Wage:
                         <h3>
-                            <Label basic>${currentUser?.user_data &&
-                                currentUser?.user_data.map((uData) => uData.wage)}/h
+                            <Label basic>${true}/h
                             </Label>  
                         </h3>

[NoCoverage] ArrowFunction
frontend/src/components/Profile.js:132:60
                         <Header>Wage:
                         <h3>
                             <Label basic>${currentUser?.user_data &&
-                                currentUser?.user_data.map((uData) => uData.wage)}/h
+                                currentUser?.user_data.map(() => undefined)}/h
                             </Label>  
                         </h3>

[NoCoverage] OptionalChaining
frontend/src/components/Profile.js:132:33
                         <Header>Wage:
                         <h3>
                             <Label basic>${currentUser?.user_data &&
-                                currentUser?.user_data.map((uData) => uData.wage)}/h
+                                currentUser.user_data.map((uData) => uData.wage)}/h
                             </Label>  
                         </h3>
