[Survived] StringLiteral
frontend/src/components/SignUp.js:10:60
 
 const SignUp = () => {
 
-const roleOptions = [{ key: 'admin', value: 'ADMIN', text: 'Administrator' },
+const roleOptions = [{ key: 'admin', value: 'ADMIN', text: "" },
 { key: 'regular', value: 'REGULAR', text: 'Regular Employee' }]
 

[Survived] StringLiteral
frontend/src/components/SignUp.js:11:26
 const SignUp = () => {
 
 const roleOptions = [{ key: 'admin', value: 'ADMIN', text: 'Administrator' },
-{ key: 'regular', value: 'REGULAR', text: 'Regular Employee' }]
+{ key: 'regular', value: "", text: 'Regular Employee' }]
 
 const [username, setUsername] = useState("");

[Survived] StringLiteral
frontend/src/components/SignUp.js:11:43
 const SignUp = () => {
 
 const roleOptions = [{ key: 'admin', value: 'ADMIN', text: 'Administrator' },
-{ key: 'regular', value: 'REGULAR', text: 'Regular Employee' }]
+{ key: 'regular', value: 'REGULAR', text: "" }]
 
 const [username, setUsername] = useState("");

[Survived] BooleanLiteral
frontend/src/components/SignUp.js:14:52
 { key: 'regular', value: 'REGULAR', text: 'Regular Employee' }]
 
 const [username, setUsername] = useState("");
-const [usernameTaken, setUsernameTaken] = useState(false);
+const [usernameTaken, setUsernameTaken] = useState(true);
 const [email, setEmail] = useState("");
 const [validEmail, validateEmail] = useState(true);

[Survived] BooleanLiteral
frontend/src/components/SignUp.js:16:46
 const [username, setUsername] = useState("");
 const [usernameTaken, setUsernameTaken] = useState(false);
 const [email, setEmail] = useState("");
-const [validEmail, validateEmail] = useState(true);
+const [validEmail, validateEmail] = useState(false);
 const [password, setPassword] = useState("");
 const [validPassword, validatePassword] = useState(true);

[Survived] BooleanLiteral
frontend/src/components/SignUp.js:18:52
 const [email, setEmail] = useState("");
 const [validEmail, validateEmail] = useState(true);
 const [password, setPassword] = useState("");
-const [validPassword, validatePassword] = useState(true);
+const [validPassword, validatePassword] = useState(false);
 const [wage, setWage] = useState();
 const [role, setRole] = useState("");

[Survived] StringLiteral
frontend/src/components/SignUp.js:24:40
 const [first_name, setFN] = useState("");
 const [last_name, setLN] = useState("");
 
-const [message, setMessage] = useState("");
+const [message, setMessage] = useState("Stryker was here!");
 const [successful, setSuccessful] = useState(false);
 

[Survived] BooleanLiteral
frontend/src/components/SignUp.js:25:46
 const [last_name, setLN] = useState("");
 
 const [message, setMessage] = useState("");
-const [successful, setSuccessful] = useState(false);
+const [successful, setSuccessful] = useState(true);
 
 const onChangeUsername = (e) => {

[NoCoverage] BlockStatement
frontend/src/components/SignUp.js:27:33
 const [message, setMessage] = useState("");
 const [successful, setSuccessful] = useState(false);
 
-const onChangeUsername = (e) => {
-    const username = e.target.value;
-    setUsername(username);
-}
+const onChangeUsername = (e) => {}
 
 const onChangeFN = (e) => {

[NoCoverage] BlockStatement
frontend/src/components/SignUp.js:32:27
     setUsername(username);
 }
 
-const onChangeFN = (e) => {
-  const first_name = e.target.value;
-  setFN(first_name);
-}
+const onChangeFN = (e) => {}
 
 const onChangeLN = (e) => {

[NoCoverage] BlockStatement
frontend/src/components/SignUp.js:37:27
   setFN(first_name);
 }
 
-const onChangeLN = (e) => {
-  const last_name = e.target.value;
-  setLN(last_name);
-}
+const onChangeLN = (e) => {}
 
 

[NoCoverage] BlockStatement
frontend/src/components/SignUp.js:43:30
 }
 
 
-const onChangeEmail = (e) => {
-    const email = e.target.value;
-    setEmail(email);
-    validateEmail(EmailValidator.validate(email));
-};
+const onChangeEmail = (e) => {};
 
 //To validate password

[Survived] StringLiteral
frontend/src/components/SignUp.js:59:32
 .has().lowercase()                              // Must have lowercase letters
 .has().digits(2)                                // Must have at least 2 digits
 .has().not().spaces()                           // Should not have spaces
-.is().not().oneOf(['Passw0rd', 'Password123']); // Blacklist these values
+.is().not().oneOf(['Passw0rd', ""]); // Blacklist these values
 
 const onChangePassword = (e) => {

[NoCoverage] BlockStatement
frontend/src/components/SignUp.js:61:33
 .has().not().spaces()                           // Should not have spaces
 .is().not().oneOf(['Passw0rd', 'Password123']); // Blacklist these values
 
-const onChangePassword = (e) => {
-    const password = e.target.value;
-    setPassword(password);
-    validatePassword(schema.validate(password))
-};
+const onChangePassword = (e) => {};
 
 const onChangeWage = (e) => {

[NoCoverage] BlockStatement
frontend/src/components/SignUp.js:67:29
     validatePassword(schema.validate(password))
 };
 
-const onChangeWage = (e) => {
-    const wage = e.target.value;
-    setWage(wage);
-}
+const onChangeWage = (e) => {}
 
 const onChangeRole = (e, data) => {

[NoCoverage] BlockStatement
frontend/src/components/SignUp.js:72:35
     setWage(wage);
 }
 
-const onChangeRole = (e, data) => {
-    const role = data.value;
-    setRole(role);
-}
+const onChangeRole = (e, data) => {}
 
 const handleRegister = (e) => {

[NoCoverage] BlockStatement
frontend/src/components/SignUp.js:77:31
     setRole(role);
 }
 
-const handleRegister = (e) => {
-    e.preventDefault();
-
-    setMessage(""); //error message that can be displayed
-    setSuccessful(false);
-
-    AuthService.register(username, email, password, role, wage, first_name, last_name).then(
-        (response) => {
-          setMessage(response.data.message);
-          setSuccessful(true);
-        },
-        (error) => {
-          const resMessage =
-            (error.response &&
-              error.response.data &&
-              error.response.data.message) ||
-            error.message ||
-            error.toString();
-
-          setMessage(resMessage);
-          setSuccessful(false);
-        }
-      );
-  };
+const handleRegister = (e) => {};
 
 return (

[NoCoverage] BooleanLiteral
frontend/src/components/SignUp.js:81:19
     e.preventDefault();
 
     setMessage(""); //error message that can be displayed
-    setSuccessful(false);
+    setSuccessful(true);
 
     AuthService.register(username, email, password, role, wage, first_name, last_name).then(

[NoCoverage] BlockStatement
frontend/src/components/SignUp.js:84:23
     setSuccessful(false);
 
     AuthService.register(username, email, password, role, wage, first_name, last_name).then(
-        (response) => {
-          setMessage(response.data.message);
-          setSuccessful(true);
-        },
+        (response) => {},
         (error) => {
           const resMessage =

[NoCoverage] BooleanLiteral
frontend/src/components/SignUp.js:86:25
     AuthService.register(username, email, password, role, wage, first_name, last_name).then(
         (response) => {
           setMessage(response.data.message);
-          setSuccessful(true);
+          setSuccessful(false);
         },
         (error) => {

[NoCoverage] BlockStatement
frontend/src/components/SignUp.js:88:20
           setMessage(response.data.message);
           setSuccessful(true);
         },
-        (error) => {
-          const resMessage =
-            (error.response &&
-              error.response.data &&
-              error.response.data.message) ||
-            error.message ||
-            error.toString();
-
-          setMessage(resMessage);
-          setSuccessful(false);
-        }
+        (error) => {}
       );
   };

[NoCoverage] LogicalOperator
frontend/src/components/SignUp.js:90:14
         },
         (error) => {
           const resMessage =
-            (error.response &&
-              error.response.data &&
-              error.response.data.message) ||
+            (error.response && error.response.data || error.response.data.message) ||
             error.message ||
             error.toString();

[NoCoverage] LogicalOperator
frontend/src/components/SignUp.js:90:13
         },
         (error) => {
           const resMessage =
-            (error.response &&
-              error.response.data &&
-              error.response.data.message) ||
-            error.message ||
+            error.response && error.response.data && error.response.data.message && error.message ||
             error.toString();
 

[NoCoverage] BooleanLiteral
frontend/src/components/SignUp.js:97:25
             error.toString();
 
           setMessage(resMessage);
-          setSuccessful(false);
+          setSuccessful(true);
         }
       );

[Survived] BooleanLiteral
frontend/src/components/SignUp.js:128:31
           <Form.Input fluid icon='mail' iconPosition='left' placeholder='E-mail address' // email
           value={email}
           onChange={onChangeEmail}
-          error={validEmail ? false: {
+          error={validEmail ? true: {
               content: 'Please enter a valid email address.',
               pointing: 'below'

[Survived] BooleanLiteral
frontend/src/components/SignUp.js:140:36
             type='password'
             value={password}
             onChange={onChangePassword}
-            error={validPassword ? false: {
+            error={validPassword ? true: {
                 content: 'Please enter a valid password.',
                 pointing: 'below'

[NoCoverage] StringLiteral
frontend/src/components/SignUp.js:142:27
             onChange={onChangePassword}
             error={validPassword ? false: {
                 content: 'Please enter a valid password.',
-                pointing: 'below'
+                pointing: ""
             }}
           />

[Survived] ConditionalExpression
frontend/src/components/SignUp.js:181:10
         <Form.Field required>
             <Form.Checkbox align='left' label="I accept the Terms & Conditions."/>
         </Form.Field>
-        {message && (
-            <Form.Group>
-              <div
-                className={ successful ? "alert alert-success" : "alert alert-danger" }
-                role="alert"
-              >
-                {message}
-              </div>
-            </Form.Group>
-          )}
+        {true}
           <Button type='submit' color='black' fluid size='large'>
             Sing Up

[Survived] ConditionalExpression
frontend/src/components/SignUp.js:181:10
         <Form.Field required>
             <Form.Checkbox align='left' label="I accept the Terms & Conditions."/>
         </Form.Field>
-        {message && (
-            <Form.Group>
-              <div
-                className={ successful ? "alert alert-success" : "alert alert-danger" }
-                role="alert"
-              >
-                {message}
-              </div>
-            </Form.Group>
-          )}
+        {false}
           <Button type='submit' color='black' fluid size='large'>
             Sing Up

[NoCoverage] StringLiteral
frontend/src/components/SignUp.js:184:66
         {message && (
             <Form.Group>
               <div
-                className={ successful ? "alert alert-success" : "alert alert-danger" }
+                className={ successful ? "alert alert-success" : "" }
                 role="alert"
               >
