[Killed] BlockStatement
frontend/src/services/user.services.js:12:30
 const currentUser = AuthService.getCurrentUser(); // remember to handle when there is no user logged-in
 
 //gets all timesheets of an user
-const getTimehsheets = () => {
-  return axios.get(API_URL + "/timesheet/" + `${currentUser?.user_data[0].employee_id}`, { headers: authHeader() });
-};
+const getTimehsheets = () => {};
 
 
killedBy: mock components tests renders without crashing
statusReason: TypeError: Cannot read property 'then' of undefined

[Killed] OptionalChaining
frontend/src/services/user.services.js:13:49
 
 //gets all timesheets of an user
 const getTimehsheets = () => {
-  return axios.get(API_URL + "/timesheet/" + `${currentUser?.user_data[0].employee_id}`, { headers: authHeader() });
+  return axios.get(API_URL + "/timesheet/" + `${currentUser.user_data[0].employee_id}`, { headers: authHeader() });
 };
 
killedBy: mock components tests renders without crashing
statusReason: TypeError: Cannot read property 'user_data' of null

[Survived] ObjectLiteral
frontend/src/services/user.services.js:13:90
 
 //gets all timesheets of an user
 const getTimehsheets = () => {
-  return axios.get(API_URL + "/timesheet/" + `${currentUser?.user_data[0].employee_id}`, { headers: authHeader() });
+  return axios.get(API_URL + "/timesheet/" + `${currentUser?.user_data[0].employee_id}`, {});
 };
 

[NoCoverage] BlockStatement
frontend/src/services/user.services.js:17:75
 };
 
 
-const createTimesheet = (employee_id, start_time, end_time, work_desc) => {
-  return axios.post(API_URL + "User/usersAva", {
-    employee_id,
-    start_time,
-    end_time,
-    work_desc
-  });
-}
+const createTimesheet = (employee_id, start_time, end_time, work_desc) => {}
 
 // const deleteInvitee = (invited_id, meeting_id, user_id) => {

[NoCoverage] ObjectLiteral
frontend/src/services/user.services.js:18:48
 
 
 const createTimesheet = (employee_id, start_time, end_time, work_desc) => {
-  return axios.post(API_URL + "User/usersAva", {
-    employee_id,
-    start_time,
-    end_time,
-    work_desc
-  });
+  return axios.post(API_URL + "User/usersAva", {});
 }
 
