[Killed] BlockStatement
INSOProject/frontend/src/App.js:3:16
 import React from "react";
 
-function App() {
-
-    return <div>
-        <h1>Hello World! This is Timeflocker!</h1>
-    </div>
-};
+function App() {};
 
 export default App;
killedBy: mock components tests renders without crashing
statusReason: Error: App(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
